---
kind: method
id: M:Autodesk.Revit.UI.ExternalApplicationArray.ReverseIterator
source: html/c9d5323d-366a-34eb-4068-ca41b08a6880.htm
---
# Autodesk.Revit.UI.ExternalApplicationArray.ReverseIterator Method

Retrieve a backward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual ExternalApplicationArrayIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the array.